In [1]:
print('Hello world')

Hello world

In [5]:
 x = 5
for i in range (0, 5):
        print (x + i)

5
6
7
8
9

In [7]:
import pandas as pd

In [13]:
data = pd.read_csv('../Cost_and_fees.csv', skiprows=4, nrows = 201)
data

,1,2,3,4,5,6,7,8,9,10,...,16,17,18,19,20,21,22,23,24,25
0,All institutions,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1963-64,"$10,248","$10,561","$6,368","$4,174","$4,538","$1,406","$2,319","$2,288","$1,717",...,$775,$508,$553,$171,$282,$279,$209,$457,$455,$395
2,1968-69,"10,357","10,973","7,477","4,234","4,852","1,778","2,558","2,557","2,321",...,"1,053",596,683,250,360,360,327,502,502,476
3,1969-70,"10,460","11,227","7,304","4,325","5,062","1,659","2,610","2,627","2,326",...,"1,089",645,755,247,389,392,347,526,528,495
4,1970-71,"10,537","11,376","7,143","4,387","5,188","1,590","2,670","2,690","2,355",...,"1,120",688,814,249,419,422,369,546,549,501
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,2014-15,"25,011","24,908","27,426","14,951","14,901","15,255","6,202","6,204","6,185",...,"25,629","13,972","13,924","14,256","5,796","5,798","5,780","3,605","3,554","5,594"
197,2015-16,"25,273","25,215","25,840","15,086","15,041","15,388","6,217","6,209","6,301",...,"24,310","14,193","14,150","14,477","5,849","5,842","5,928","3,735","3,731","3,905"
198,2016-17,"26,543","26,648","26,121","15,050","15,053","15,028","7,190","7,302","6,563",...,"25,027","14,419","14,423","14,399","6,889","6,996","6,288","4,123","4,113","4,340"
199,2017-18,"26,797","26,951","25,584","14,973","14,982","14,908","7,418","7,565","6,229",...,"25,065","14,669","14,677","14,606","7,268","7,411","6,102","4,317","4,315","4,357"
200,2018-19,"27,040","26,575","30,052","14,780","14,715","15,360","7,118","7,410","5,305",...,"30,052","14,780","14,715","15,360","7,118","7,410","5,305","5,143","4,450","9,387"

In [14]:
data.drop(0)

,1,2,3,4,5,6,7,8,9,10,...,16,17,18,19,20,21,22,23,24,25
1,1963-64,"$10,248","$10,561","$6,368","$4,174","$4,538","$1,406","$2,319","$2,288","$1,717",...,$775,$508,$553,$171,$282,$279,$209,$457,$455,$395
2,1968-69,"10,357","10,973","7,477","4,234","4,852","1,778","2,558","2,557","2,321",...,"1,053",596,683,250,360,360,327,502,502,476
3,1969-70,"10,460","11,227","7,304","4,325","5,062","1,659","2,610","2,627","2,326",...,"1,089",645,755,247,389,392,347,526,528,495
4,1970-71,"10,537","11,376","7,143","4,387","5,188","1,590","2,670","2,690","2,355",...,"1,120",688,814,249,419,422,369,546,549,501
5,1971-72,"10,651","11,556","7,212","4,455","5,326","1,544","2,738","2,760","2,406",...,"1,172",724,865,251,445,448,391,562,564,530
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,2014-15,"25,011","24,908","27,426","14,951","14,901","15,255","6,202","6,204","6,185",...,"25,629","13,972","13,924","14,256","5,796","5,798","5,780","3,605","3,554","5,594"
197,2015-16,"25,273","25,215","25,840","15,086","15,041","15,388","6,217","6,209","6,301",...,"24,310","14,193","14,150","14,477","5,849","5,842","5,928","3,735","3,731","3,905"
198,2016-17,"26,543","26,648","26,121","15,050","15,053","15,028","7,190","7,302","6,563",...,"25,027","14,419","14,423","14,399","6,889","6,996","6,288","4,123","4,113","4,340"
199,2017-18,"26,797","26,951","25,584","14,973","14,982","14,908","7,418","7,565","6,229",...,"25,065","14,669","14,677","14,606","7,268","7,411","6,102","4,317","4,315","4,357"
200,2018-19,"27,040","26,575","30,052","14,780","14,715","15,360","7,118","7,410","5,305",...,"30,052","14,780","14,715","15,360","7,118","7,410","5,305","5,143","4,450","9,387"

In [15]:
data.columns

Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13',
       '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25'],
      dtype='object')

In [17]:
column_names = ['1', '2', '3']
data[column_names].head(10)

                  1        2        3
0  All institutions      NaN      NaN
1          1963-64   $10,248  $10,561
2          1968-69    10,357   10,973
3          1969-70    10,460   11,227
4          1970-71    10,537   11,376
5          1971-72    10,651   11,556
6          1972-73    10,853   12,015
7          1973-74    10,337   11,392
8          1974-75     9,698   10,693
9          1975-76     9,605   10,754

In [18]:
data.loc[1]

1     1963-64
2      $10,248
3      $10,561
4       $6,368
5       $4,174
6       $4,538
7       $1,406
8       $2,319
9       $2,288
10      $1,717
11      $3,756
12      $3,736
13      $3,244
14      $1,248
15      $1,286
16        $775
17        $508
18        $553
19        $171
20        $282
21        $279
22        $209
23        $457
24        $455
25        $395
Name: 1, dtype: object

In [19]:
data.loc[1][3]

'$6,368'

In [25]:
def cast_to_numeric(string):
    if type(string) == float:
        return string
    else:
        string = string.replace('$', '')
        string = string.replace(',', '')
        number = float(string)
        return number

In [26]:
cast_to_numeric('$1000,20000')

100020000.0

In [28]:
data['2'] = data['2'].apply(cast_to_numeric)

In [29]:
data['2'].mean()

20803.918367346938

In [30]:
data['2'].sum()

4077568.0

In [31]:
data['2'].min()

6939.0

In [32]:
columns_to_change = ['2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13',
       '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25']

for column in columns_to_change:
    data[column] = data[column].apply(cast_to_numeric)

Header (markdown instead of code)

### Practice with needed data      ('../Cost_and_fees.csv', skiprows=4, nrows = 201)

In [33]:
import pandas as pd

In [47]:
Cost_Data = pd.read_csv('../Data/Bachelors_Weekly_Salary.csv', skiprows = 17)
Cost_Data

   Years: 2011 to 2021 Unnamed: 2 Unnamed: 3 Unnamed: 4  Unnamed: 5
0     NaN          NaN        NaN        NaN        NaN         NaN
1    Year         Qtr1       Qtr2       Qtr3       Qtr4         NaN
2    2011          734        730        727        742         NaN
3    2012          733        736        725        738         NaN
4    2013          740        746        746        756         NaN
5    2014          754        737        732        756         NaN
6    2015          758        762        761        765         NaN
7    2016          778        779        785        783         NaN
8    2017          803        802        783        772         NaN
9    2018          798        805        831        804         NaN
10   2019          817        841        849        880         NaN
11   2020          877        893        899        876         NaN
12   2021          875        901        NaN        NaN         NaN

1     1968-69
2      10357.0
3      10973.0
4       7477.0
5       4234.0
6       4852.0
7       1778.0
8       2558.0
9       2557.0
10      2321.0
11      3565.0
12      3564.0
13      3378.0
14      1459.0
15      1545.0
16      1053.0
17       596.0
18       683.0
19       250.0
20       360.0
21       360.0
22       327.0
23       502.0
24       502.0
25       476.0
Name: 2, dtype: object

In [51]:
Cost_Data.columns

Index(['Years:', '2011 to 2021', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5'],
      dtype='object')

In [52]:
Cost_data.loc[2]

NameError: name 'Cost_data' is not defined